[{
	"id": 1,
	"location": "Inside McGrubor's Wood, west of Seers' Village. Fairy ring code als. If approaching from outside, squeeze through the broken fence by the northern half of the hut in the center and search the crate south of the house."
},
{
	"id": 2,
	"location": "Search the crate by the Clock Tower, south-west of East Ardougne. Ardougne cloak is fastest travel method. Spirit tree to Battlefield of Khazard is also close."
},
{
	"id": 3,
	"location": "In level 14 Wilderness, at the Dark Warriors' Fortress, search the pile of crates in the south-west corner of the central courtyard."
},
{
	"id": 4,
	"location": "North east of the Observatory, north of Castle Wars, search a crate in the western most building of the goblin overrun houses. This house holds the entrance stairs to the dungeon below."
},
{
	"id": 5,
	"location": "Search the crate inside the Lumberyard, northeast of Varrock."
},
{
	"id": 6,
	"location": "Directly behind the Wizards' Tower, there's a fern you can use as a reference, the dig spot is one tile directly north of the fern."
},
{
	"id": 7,
	"location": "One tile west of the north door of Galahad's house, west of McGrubor's Wood."
},
{
	"id": 8,
	"location": "On Miscellania, one of the Fremennik Isles, just east of the castle."
},
{
	"id": 9,
	"location": "Just south of East Ardougne, (straight south of town square) north of the Tower of Life, near the Necromancer Tower. Dig two spaces north of the smaller crate that Bonafido is leaning on. Fairy ring code djp is very close."
},
{
	"id": 10,
	"location": "West of the Crafting Guild. Dig north of the sandpile at the tip of the peninsula."
},
{
	"id": 11,
	"location": "Just west of the Chemist's house in Rimmington. South of Falador, west of Port Sarim."
},
{
	"id": 12,
	"location": "Located in West Ardougne, dig inside one of the destroyed buildings. It is in the north-east corner of the housing buildings in the south-west area of West Ardougne. Head due west from the main gate, and you'll get to the buildings."
},
{
	"id": 13,
	"location": "South of Yanille bank. Behind the house with an anvil."
},
{
	"id": 14,
	"location": "Just north of Al-Kharid, in the center of the mine."
},
{
	"id": 15,
	"location": "Just north of Falador in the standing stone circle"
},
{
	"id": 16,
	"location": "Locate the single tree that is west of the Champions' Guild, outside Varrock. Dig two squares to east of it."
},
{
	"id": 17,
	"location": "The statue is located at the crossroads north of Falador."
},
{
	"id": 18,
	"location": "South-eastern Varrock Mine. Dig one square west of the plant."
},
{
	"id": 19,
	"location": "West of the Khazard Battlefield."
},
{
	"id": 20,
	"location": "Road between Rellekka and the Lighthouse"
},
{
	"id": 21,
	"location": "North of Seers' Village, along the path towards Rellekka."
},
{
	"id": 22,
	"location": "The picnic tables south of the Legends' Guild, northeast of East Ardougne."
},
{
	"id": 23,
	"location": "Level 50 Wilderness, near Wilderness Agility Course; south-west of Deep Wilderness Dungeon entrance and west of the Mage Arena."
},
{
	"id": 24,
	"location": "North east of Castle Wars, just southwest of the Gnome Maze."
},
{
	"id": 25,
	"location": "South of Draynor Village bank, by the fishing spot."
},
{
	"id": 26,
	"location": "North of the Abandoned Mine, by the path to Mort'ton."
},
{
	"id": 27,
	"location": "In the south-west coast of Ape Atoll, there is a little shack where the crate is located. Fairy ring code CLR is close to it. Bring a ninja monkey greegree or Kruk greegree if using the fairy ring."
},
{
	"id": 28,
	"location": "East of the Burgh de Rott furnace. Requires starting In Aid of the Myreque."
},
{
	"id": 29,
	"location": "Inside the mudskipper cave west of the Mogre Camp. Players must collect five rocks before going inside."
},
{
	"id": 30,
	"location": "Directly south of the soul altar."
},
{
	"id": 31,
	"location": "East of the small building in Zul-Andra, next to the tree. Requires starting Regicide."
}]